grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_fs_global.h
/** @defgroup otg_fs_global_otg_hs_gahbcfg OTGHSGAHBCFG OTG_HS AHB configuration register
@{*/

/** OTG_FS_GLOBAL_OTG_HS_GAHBCFG_PTXFELVL Periodic TxFIFO empty level **/
#define OTG_FS_GLOBAL_OTG_HS_GAHBCFG_PTXFELVL		(1 << 8)
/** OTG_FS_GLOBAL_OTG_HS_GAHBCFG_TXFELVL TxFIFO empty level **/
#define OTG_FS_GLOBAL_OTG_HS_GAHBCFG_TXFELVL		(1 << 7)
/** OTG_FS_GLOBAL_OTG_HS_GAHBCFG_DMAEN DMA enable **/
#define OTG_FS_GLOBAL_OTG_HS_GAHBCFG_DMAEN		(1 << 5)

#define OTG_FS_GLOBAL_OTG_HS_GAHBCFG_HBSTLEN_SHIFT		1
#define OTG_FS_GLOBAL_OTG_HS_GAHBCFG_HBSTLEN_MASK		0x0f
/** @defgroup otg_fs_global_otg_hs_gahbcfg_hbstlen HBSTLEN Burst length/type
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_HS_GAHBCFG_GINT Global interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GAHBCFG_GINT		(1 << 0)

/**@}*/

/** @defgroup otg_fs_global_otg_hs_gusbcfg OTGHSGUSBCFG OTG_HS USB configuration register
@{*/

/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_FDMOD Forced peripheral mode **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_FDMOD		(1 << 30)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_FHMOD Forced host mode **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_FHMOD		(1 << 29)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPIIPD ULPI interface protect disable **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPIIPD		(1 << 25)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_PTCI Indicator pass through **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_PTCI		(1 << 24)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_PCCI Indicator complement **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_PCCI		(1 << 23)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_TSDPS TermSel DLine pulsing selection **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_TSDPS		(1 << 22)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSI ULPI external VBUS indicator **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSI		(1 << 21)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSD ULPI External VBUS Drive **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSD		(1 << 20)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPICSM ULPI Clock SuspendM **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPICSM		(1 << 19)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPIAR ULPI Auto-resume **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPIAR		(1 << 18)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPIFSLS ULPI FS/LS select **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_ULPIFSLS		(1 << 17)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_PHYLPCS PHY Low-power clock select **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_PHYLPCS		(1 << 15)

#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_TRDT_SHIFT		10
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_TRDT_MASK		0x0f
/** @defgroup otg_fs_global_otg_hs_gusbcfg_trdt TRDT USB turnaround time
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_HNPCAP HNP-capable **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_HNPCAP		(1 << 9)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_SRPCAP SRP-capable **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_SRPCAP		(1 << 8)
/** OTG_FS_GLOBAL_OTG_HS_GUSBCFG_PHYSEL USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select **/
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_PHYSEL		(1 << 6)

#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_TOCAL_SHIFT		0
#define OTG_FS_GLOBAL_OTG_HS_GUSBCFG_TOCAL_MASK		0x07
/** @defgroup otg_fs_global_otg_hs_gusbcfg_tocal TOCAL FS timeout calibration
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_hs_grstctl OTGHSGRSTCTL OTG_HS reset register
@{*/

/** OTG_FS_GLOBAL_OTG_HS_GRSTCTL_AHBIDL AHB master idle **/
#define OTG_FS_GLOBAL_OTG_HS_GRSTCTL_AHBIDL		(1 << 31)
/** OTG_FS_GLOBAL_OTG_HS_GRSTCTL_DMAREQ DMA request signal enabled for USB OTG HS **/
#define OTG_FS_GLOBAL_OTG_HS_GRSTCTL_DMAREQ		(1 << 30)

#define OTG_FS_GLOBAL_OTG_HS_GRSTCTL_TXFNUM_SHIFT		6
#define OTG_FS_GLOBAL_OTG_HS_GRSTCTL_TXFNUM_MASK		0x1f
/** @defgroup otg_fs_global_otg_hs_grstctl_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_HS_GRSTCTL_TXFFLSH TxFIFO flush **/
#define OTG_FS_GLOBAL_OTG_HS_GRSTCTL_TXFFLSH		(1 << 5)
/** OTG_FS_GLOBAL_OTG_HS_GRSTCTL_RXFFLSH RxFIFO flush **/
#define OTG_FS_GLOBAL_OTG_HS_GRSTCTL_RXFFLSH		(1 << 4)
/** OTG_FS_GLOBAL_OTG_HS_GRSTCTL_FCRST Host frame counter reset **/
#define OTG_FS_GLOBAL_OTG_HS_GRSTCTL_FCRST		(1 << 2)
/** OTG_FS_GLOBAL_OTG_HS_GRSTCTL_HSRST HCLK soft reset **/
#define OTG_FS_GLOBAL_OTG_HS_GRSTCTL_HSRST		(1 << 1)
/** OTG_FS_GLOBAL_OTG_HS_GRSTCTL_CSRST Core soft reset **/
#define OTG_FS_GLOBAL_OTG_HS_GRSTCTL_CSRST		(1 << 0)

/**@}*/

/** @defgroup otg_fs_global_otg_hs_gintsts OTGHSGINTSTS OTG_HS core interrupt register
@{*/

/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_WKUINT Resume/remote wakeup detected interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_WKUINT		(1 << 31)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_SRQINT Session request/new session detected interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_SRQINT		(1 << 30)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_DISCINT Disconnect detected interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_DISCINT		(1 << 29)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_CIDSCHG Connector ID status change **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_CIDSCHG		(1 << 28)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_PTXFE Periodic TxFIFO empty **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_PTXFE		(1 << 26)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_HCINT Host channels interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_HCINT		(1 << 25)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_HPRTINT Host port interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_HPRTINT		(1 << 24)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_DATAFSUSP Data fetch suspended **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_DATAFSUSP		(1 << 22)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_PXFR_INCOMPISOOUT Incomplete periodic transfer **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_PXFR_INCOMPISOOUT		(1 << 21)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_IISOIXFR Incomplete isochronous IN transfer **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_IISOIXFR		(1 << 20)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_OEPINT OUT endpoint interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_OEPINT		(1 << 19)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_IEPINT IN endpoint interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_IEPINT		(1 << 18)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_EOPF End of periodic frame interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_EOPF		(1 << 15)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_ISOODRP Isochronous OUT packet dropped interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_ISOODRP		(1 << 14)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_ENUMDNE Enumeration done **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_ENUMDNE		(1 << 13)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_USBRST USB reset **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_USBRST		(1 << 12)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_USBSUSP USB suspend **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_USBSUSP		(1 << 11)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_ESUSP Early suspend **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_ESUSP		(1 << 10)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_BOUTNAKEFF Global OUT NAK effective **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_BOUTNAKEFF		(1 << 7)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_GINAKEFF Global IN nonperiodic NAK effective **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_GINAKEFF		(1 << 6)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_NPTXFE Nonperiodic TxFIFO empty **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_NPTXFE		(1 << 5)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_RXFLVL RxFIFO nonempty **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_RXFLVL		(1 << 4)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_SOF Start of frame **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_SOF		(1 << 3)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_OTGINT OTG interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_OTGINT		(1 << 2)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_MMIS Mode mismatch interrupt **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_MMIS		(1 << 1)
/** OTG_FS_GLOBAL_OTG_HS_GINTSTS_CMOD Current mode of operation **/
#define OTG_FS_GLOBAL_OTG_HS_GINTSTS_CMOD		(1 << 0)

/**@}*/

/** @defgroup otg_fs_global_otg_hs_gintmsk OTGHSGINTMSK OTG_HS interrupt mask register
@{*/

/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_WUIM Resume/remote wakeup detected interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_WUIM		(1 << 31)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_SRQIM Session request/new session detected interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_SRQIM		(1 << 30)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_DISCINT Disconnect detected interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_DISCINT		(1 << 29)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_CIDSCHGM Connector ID status change mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_CIDSCHGM		(1 << 28)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_LPMINTM LPM interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_LPMINTM		(1 << 27)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_PTXFEM Periodic TxFIFO empty mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_PTXFEM		(1 << 26)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_HCIM Host channels interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_HCIM		(1 << 25)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_PRTIM Host port interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_PRTIM		(1 << 24)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_RSTDE Reset detected interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_RSTDE		(1 << 23)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_FSUSPM Data fetch suspended mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_FSUSPM		(1 << 22)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_PXFRM_IISOOXFRM Incomplete periodic transfer mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_PXFRM_IISOOXFRM		(1 << 21)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_IISOIXFRM Incomplete isochronous IN transfer mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_IISOIXFRM		(1 << 20)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_OEPINT OUT endpoints interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_OEPINT		(1 << 19)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_IEPINT IN endpoints interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_IEPINT		(1 << 18)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_EOPFM End of periodic frame interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_EOPFM		(1 << 15)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_ISOODRPM Isochronous OUT packet dropped interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_ISOODRPM		(1 << 14)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_ENUMDNEM Enumeration done mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_ENUMDNEM		(1 << 13)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_USBRST USB reset mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_USBRST		(1 << 12)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_USBSUSPM USB suspend mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_USBSUSPM		(1 << 11)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_ESUSPM Early suspend mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_ESUSPM		(1 << 10)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_GONAKEFFM Global OUT NAK effective mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_GONAKEFFM		(1 << 7)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_GINAKEFFM Global nonperiodic IN NAK effective mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_GINAKEFFM		(1 << 6)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_NPTXFEM Nonperiodic TxFIFO empty mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_NPTXFEM		(1 << 5)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_RXFLVLM Receive FIFO nonempty mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_RXFLVLM		(1 << 4)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_SOFM Start of frame mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_SOFM		(1 << 3)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_OTGINT OTG interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_OTGINT		(1 << 2)
/** OTG_FS_GLOBAL_OTG_HS_GINTMSK_MMISM Mode mismatch interrupt mask **/
#define OTG_FS_GLOBAL_OTG_HS_GINTMSK_MMISM		(1 << 1)

/**@}*/

/** @defgroup otg_fs_global_otg_hs_grxstsr_host OTGHSGRXSTSRHost OTG_HS Receive status debug read register (host mode)
@{*/


#define OTG_FS_GLOBAL_OTG_HS_GRXSTSR_Host_PKTSTS_SHIFT		17
#define OTG_FS_GLOBAL_OTG_HS_GRXSTSR_Host_PKTSTS_MASK		0x0f
/** @defgroup otg_fs_global_otg_hs_grxstsr_host_pktsts PKTSTS Packet status
@{*/
/**@}*/


